/*7、一批20本图书（书名，作者，出版社，价格，出版日期）。
编程：
（1）求购买2000年（包括2000年）以后出版的数的花销？
（2）共买了高等教育出版社的书籍有多少本？*/
#include <stdio.h>
#include <string.h>
struct cbrqs
{
	int year;
	int month;
	int day;
};
typedef struct books
{
	char name[30];
	char author[20];
	char publish[40];
	float price;
	struct cbrqs cbrq;	
}book;
//求成本
float huaxiao(book tt[],int n,int x)
{
	float sum=0;
	for(int i=0;i<20;i++)
		if(tt[i].cbrq.year>=x)
			sum+=tt[i].price;	
		return sum;
}
//求册数
int count(book tt[],int n,char ts[])
{
	int j=0;
	for(int i=0;i<n;i++)
		if(strcmp(tt[i].publish,ts)==0)
			j++;
		return j;	
}
int main()
{   book ts[20]={"操作系统","汤子瀛","北京大学出版社",37,1997,3,15,"操作系统","张丹","清华大学出版社",35,1999,5,40,"高级语言程序设计","谭浩强","高等教育出版社",40,1999,4,20,"程序设计基础","张琳","清华大学出版社",33,1994,5,15,"计算机基础","王楠","高等教育出版社",34,1995,8,15,"数据结构","严蔚敏","清华大学出版社",38,1996,4,25,"网络原理","张浩","高等教育出版社",39.5,1997,5,15,"高级语言程序设计","叶坤","北京大学出版社",36,1997,5,15,"操作系统","汤和","吉林大学出版社",35.5,1997,6,15,"java程序设计","张瀛","高等教育出版社",37,1993,3,15,"windows程序设计","苏芒","高等教育出版社",36.5,2000,7,27,"信息管理","林星","北京大学出版社",38,1998,9,12,"c程序设计","汤子瀛","北京大学出版社",37,1997,3,15,".net程序设计","何莎","高等教育出版社",37,1997,9,15,"操作系统-2","李刚","北京大学出版社",43,1999,6,11,"物联网基础","凌云","高等教育出版社",37,2017,5,29,"大数据处理","谭峰","北京大学出版社",37,2000,7,15,"操作系统","汤子","北京大学出版社",40.5,2004,3,15,"高级语言程序设计","张岩","吉林大学出版社",35,2010,12,18,"python程序设计","郑楚","北京大学出版社",35.5,2008,11,26};
int cs;
float cb;
//求2000以后出版的书的成本（包括2000年）
cb=huaxiao(ts,20,2000);
printf("2000以后出版的书的成本为：%.2f\n",cb);
//求共有多少本书来自高等教育出版社
cs=count(ts,20,"高等教育出版社");
printf("来自高等教育出版社的册数为：%d\n",cs);
return 0;
}